# --- Homebrew Taps ---
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# --- Homebrew Formulae ---
brew "gettext"
brew "autoenv"
brew "openssl@3"
brew "python@3.13"
brew "autojump"
brew "chezmoi"
brew "coreutils"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "imagemagick"
brew "neovim"
brew "nodenv"
brew "nvm"
brew "pipenv"
brew "pipx"
brew "pnpm"
brew "pyenv"
brew "rename"
brew "ripgrep"
brew "starship"
brew "thefuck"
brew "trash"
brew "tree"
brew "z"

# --- Homebrew Casks ---
cask "alt-tab"
cask "appcleaner"
cask "brave-browser"
cask "c0re100-qbittorrent"
cask "calcservice"
cask "claude"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "dupeguru"
cask "easyfind"
cask "firefox"
cask "folo"
cask "font-office-code-pro"
cask "frappe-books"
cask "github@beta"
cask "google-chrome"
cask "google-chrome@beta"
cask "google-chrome@dev"
cask "iterm2"
cask "kiro"
cask "logi-options+"
cask "middle"
cask "mission-control-plus"
cask "neo-network-utility"
cask "obsidian"
cask "photostickies"
cask "plex"
cask "plexamp"
cask "qlstephen"
cask "scrivener"
cask "sf-symbols"
cask "telegram"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "vlc"
cask "warp"
cask "windsurf"
cask "wordservice"
cask "xmenu"
cask "zulu"

# --- VS Code Extensions ---
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "antiantisepticeye.vscode-color-picker"
vscode "astro-build.astro-vscode"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "cantonios.project-templates"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "dev-doc.dev-doc"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "elitewise.obsidian-snippets"
vscode "esbenp.prettier-vscode"
vscode "estevesegura.svgl"
vscode "fivepointseven.vscode-theme-onedark-spacegray"
vscode "formulahendry.auto-rename-tag"
vscode "franzgollhammer.spacecat"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "howardzuo.vscode-npm-dependency"
vscode "ibm.output-colorizer"
vscode "idered.npm"
vscode "imgildev.vscode-astro-generator"
vscode "imgildev.vscode-auto-barrel"
vscode "imgildev.vscode-json-flow"
vscode "jasonnutter.search-node-modules"
vscode "kalimahapps.tailwind-config-viewer"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lakshits11.monokai-pirokai"
vscode "maxfieldwalker.vscode-color-theme-spirited-away"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "mushan.vscode-paste-image"
vscode "myhtica.tailwind-formatter"
vscode "natqe.reload"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "oscarmcm.ocean-space"
vscode "peymanslh.blueberry-dark-theme"
vscode "phu1237.live-reload"
vscode "pmneo.tsimporter"
vscode "pranavverma.voidcore-theme"
vscode "redhat.vscode-yaml"
vscode "royaction.color-manager"
vscode "selemondev.vscode-preview-docs"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sirwanafifi.obsidian-clipper"
vscode "sleistner.vscode-fileutils"
vscode "smpl-ndrw.deep-dark-space"
vscode "spacebox.spacebox-theme"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "tailusui.tailus-snippets"
vscode "tamasfe.even-better-toml"
vscode "thenikso.github-plus-theme"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "ursanor.space-notion-theme"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vsls-contrib.gistfs"
vscode "wayou.vscode-todo-highlight"
vscode "yasht.terminal-all-in-one"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zguolee.tabler-icons"

# --- Mac App Store Apps ---
mas "Actions", id: 1586435171
mas "Battery Indicator", id: 1206020918
mas "Bitwarden", id: 1352778147
mas "Blankie", id: 6740096581
mas "Camera Preview", id: 1632827132
mas "Charmstone", id: 1563735522
mas "ColorFolder", id: 1450345160
mas "ColorSlurp", id: 1287239339
mas "Command X", id: 6448461551
mas "Commander", id: 1636862100
mas "DaisyDisk", id: 411643860
mas "Data Jar", id: 1453273600
mas "Dato", id: 1470584107
mas "Developer", id: 640199958
mas "Feed Compass", id: 1458648487
mas "Feed Curator", id: 1458647758
mas "Folder Peek", id: 1615988943
mas "GarageBand", id: 682658836
mas "HEIC Converter", id: 1294126402
mas "Image2Icon", id: 992115977
mas "Just Press Record", id: 1033342465
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067
mas "Launchey 2", id: 1365625021
mas "Lungo", id: 1263070803
mas "Mactracker", id: 430255202
mas "Movie Explorer", id: 802224528
mas "MusicBox", id: 1614730313
mas "MusicHarbor", id: 1440405750
mas "MusicMaster", id: 633275169
mas "Name Mangler 3", id: 603637384
mas "Numbers", id: 409203825
mas "OhMyStar", id: 1218642292
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PastePal", id: 1503446680
mas "Pixelmator Pro", id: 1289583905
mas "Plain Text Editor", id: 1572202501
mas "Scratchpad", id: 6504040051
mas "ScreenFloat", id: 414528154
mas "Shortcut Keeper", id: 1585404175
mas "Simple Web Server", id: 1625925255
mas "SnippetsLab", id: 1006087419
mas "SongButler", id: 1483406279
mas "Spaced", id: 1666327168
mas "Speediness", id: 1596706466
mas "SwitchGlass", id: 1498546559
mas "Things", id: 904280696
mas "Tot", id: 1491071483
mas "Trickster", id: 509641724
mas "Type", id: 1401007562
mas "UpNote", id: 1398373917
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
